---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DebugTabBindingFailures
source: html/1dcfa779-46e3-130d-6ce8-fce704d28b30.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DebugTabBindingFailures

Failures related to binding framework demo panel on Ribbon Debug Tab.

## Syntax (C#)
```csharp
public static class DebugTabBindingFailures
```